In [8]:
# import
import pandas as pd
import numpy as np

#Dependencies added to create the connection between Python and the Postgres Database 
from sqlalchemy import create_engine
from sqlalchemy.orm import scoped_session, sessionmaker
import psycopg2

In [9]:
cleaned_hate_crimeDF = pd.read_csv('cleaned_hate_crime.csv')
cleaned_hate_crimeDF.head()

,incident_id,data_year,pub_agency_name,agency_type_name,state_abbr,state_name,region_name,incident_date,total_individual_victims,bias_desc,administration
0,15761,1993,Anchorage,City,AK,Alaska,West,14-FEB-93,2.0,Anti-Gay (Male),Clinton 1st Term
1,15762,1993,Anchorage,City,AK,Alaska,West,24-MAR-93,2.0,Anti-Black or African American,Clinton 1st Term
2,15763,1993,Anchorage,City,AK,Alaska,West,02-JUL-93,1.0,Anti-Black or African American,Clinton 1st Term
3,15764,1993,Anchorage,City,AK,Alaska,West,07-JUL-93,1.0,Anti-White,Clinton 1st Term
4,15765,1993,Anchorage,City,AK,Alaska,West,12-JUL-93,1.0,Anti-Asian,Clinton 1st Term

In [10]:
state_df = cleaned_hate_crimeDF[['data_year', 'state_abbr', 'total_individual_victims', 'administration']]
state_df.head()

   data_year state_abbr  total_individual_victims    administration
0       1993         AK                       2.0  Clinton 1st Term
1       1993         AK                       2.0  Clinton 1st Term
2       1993         AK                       1.0  Clinton 1st Term
3       1993         AK                       1.0  Clinton 1st Term
4       1993         AK                       1.0  Clinton 1st Term

In [11]:
bar_graph_df = cleaned_hate_crimeDF.groupby('data_year').bias_desc.count().to_frame(name = 'num_of_crimes').reset_index()
bar_graph_df

    data_year  num_of_crimes
0        1993           7608
1        1994           5954
2        1995           7950
3        1996           8790
4        1997           8107
5        1998           7902
6        1999           7943
7        2000           8219
8        2001           9730
9        2002           7485
10       2003           7545
11       2004           7685
12       2005           7411
13       2006           7716
14       2007           7625
15       2008           8039
16       2009           6613
17       2010           6630
18       2011           6299
19       2012           6594
20       2013           6044
21       2014           5599
22       2015           5879
23       2016           6264
24       2017           6421
25       2018           6489

In [12]:
map_df = state_df.groupby(['administration', 'data_year', 'state_abbr']).total_individual_victims.count().to_frame(name = 'victims').reset_index()
map_df

        administration  data_year state_abbr  victims
0     Clinton 1st Term       1993         AK       24
1     Clinton 1st Term       1993         AL        5
2     Clinton 1st Term       1993         AR       13
3     Clinton 1st Term       1993         AZ      208
4     Clinton 1st Term       1993         CA      364
...                ...        ...        ...      ...
1262  W. Bush 2nd Term       2008         VT       22
1263  W. Bush 2nd Term       2008         WA      240
1264  W. Bush 2nd Term       2008         WI       95
1265  W. Bush 2nd Term       2008         WV       46
1266  W. Bush 2nd Term       2008         WY        6

[1267 rows x 4 columns]

In [13]:
map_df.to_csv('victims_by_state.csv',index = False)

In [14]:
#Code to connect to  postgres database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/President_DB")
conn = engine.connect()
print(engine.table_names())

[]

In [15]:
#Code to create a table for the movies_merged_df from the cleaned dataframe above and send to the postgres database
clean_data = 'main'
cleaned_hate_crimeDF.to_sql(clean_data, conn)

In [16]:
#Code to create a table for the movies_merged_df from the cleaned dataframe above and send to the postgres database
map_data = 'map'
map_df.to_sql(map_data, conn)

In [17]:
#Code to create a table for the movies_merged_df from the cleaned dataframe above and send to the postgres database
bar_data = 'bar'
bar_graph_df.to_sql(bar_data, conn)